cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'caskroom/fonts'
tap 'shopify/shopify' # Needed for toxiproxy
cask 'java'   # Needs to be first so dependents can be installed.

brew 'autossh'
brew 'awscli'
brew 'base64'
brew 'bfg'
brew 'checkbashisms'
brew 'dos2unix'
brew 'exercism'
brew 'findutils'
brew 'fswatch'
brew 'git'
brew 'gnu-sed'
brew 'go'
brew 'heroku'
brew 'httpie'
brew 'hub'
brew 'icu4c'
brew 'jq'
brew 'keybase'
brew 'moreutils'
brew 'openssl'
brew 'pinentry-mac'
brew 'p7zip'
brew 'pstree'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rbenv-readline'
brew 'homebrew/dupes/rsync'
brew 's3cmd'
brew 'shellcheck'
brew 'sleepwatcher'
brew 'speedtest-cli'
brew 'the_silver_searcher' # ag, a faster ack
brew 'tmux'
brew 'toxiproxy'  # Requires "tap 'shopify/shopify'" above.
brew 'xz'
brew 'zsh'
brew 'zsh-completions'

cask '1password'
cask 'alfred'
cask 'apache-directory-studio'
cask 'appcleaner'
cask 'atom'
cask 'calibre'
cask 'crashplan'
cask 'dash'
cask 'dropbox'
cask 'duet'
cask 'etcher'
cask 'evernote'
cask 'fantastical'
cask 'firefox'
cask 'fitbit-connect'
cask 'flux'
cask 'franz'
cask 'garmin-express'
cask 'github-desktop'
cask 'google-chrome'
cask 'google-drive'
cask 'gpgtools'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'magicprefs'
cask 'moneydance'
cask 'postman'
cask 'skype'
cask 'skitch'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'textexpander'
cask 'the-unarchiver'
cask 'today-scripts'
cask 'torbrowser'
cask 'transmission'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'viscosity'
cask 'vlc'
cask 'vmware-fusion'
cask 'wireshark'

# AppStore Apps that need manual install for the mo.
# cask 'onenote' # Doesn't exist
# cask 'pixelmator' # Doesn't exist
# cask 'wunderlist' # Doesn't exist
