cask_args appdir: '/Applications'
# tap 'shopify/shopify'          # Needed for toxiproxy
tap 'github/gh'                 # Needed for gh
tap 'heroku/brew'               # Needed for heroku
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'     # Needed for garmin-express
tap 'homebrew/cask-fonts'       # Needed for fonts
tap 'homebrew/cask-versions'    # Needed for beta versions
tap 'homebrew/cask'
tap 'homebrew/command-not-found'
tap 'jesseduffield/lazydocker'  # Needed for lazydocker
tap 'jgavris/rs-git-fsmonitor'
tap 'muesli/tap'
tap 'yqrashawn/goku'            # Needed for goku
tap 'goreleaser/tap/goreleaser'
tap 'romkatv/gitstatus/gitstatus'
tap 'grdl/tap/git-get'
tap 'kopia/kopia'
tap 'github/packages'           # Needed for ghcs - run `gh extensions install github/gh-cs` to add as extension to gh

brew 'act'              # Run GitHub Actions locally
brew 'adr-tools'
brew 'ansible'
brew 'asdf'              # Replaces rbenv, pyenv, nodeenv etc
brew 'awscli'
brew 'azure-cli'
brew 'base64'
brew 'bash'             # Only needed for my Bash scripts now macOS isn't shipping updates etc
brew 'bat'              # Like cat, but prettier
brew 'checkbashisms'
brew 'coreutils'
brew 'croc'            # A tool for sending large files directly to someone on the CLI
brew 'diff-so-fancy'
brew 'dos2unix'
brew 'duf'
brew 'exa'
brew 'exercism'
brew 'fd'               # Like find, but faster
brew 'ffmpeg'
brew 'findutils'
brew 'fish'
brew 'fswatch'
brew 'fzf'
brew 'fzy'
brew 'gh'
brew 'ghcs'             # Without the tap: brew install github/packages/ghcs
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'gitstatus'        # Without the tap: brew install romkatv/gitstatus/gitstatus
brew 'git-get'          # Without the tap: brew install grdl/tap/git-get
brew 'gnu-sed'
brew 'gnupg'
brew 'go'
brew 'goku'
brew 'goreleaser'
brew 'grc'              # General colorizer
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'hugo'
brew 'hyperfine'        # Great cli benchmarking tool
brew 'icdiff'
brew 'icu4c'
brew 'jq'
brew 'kopia'            # UI downloadable from GitHub releases - https://github.com/kopia/kopia/releases/latest
brew 'lazydocker'
brew 'lazygit'
brew 'lcov'
brew 'lesspipe'
brew 'lockrun'
brew 'mas' # CLI tool for installing Mac App Store apps at the end of this file.
brew 'moreutils'
brew 'mosh'
brew 'neovim'
brew 'openssl'
brew 'pinentry-mac'
brew 'p7zip'
brew 'prettyping'
brew 'pstree'
brew 'rclone'
brew 'restic'
brew 'ripgrep' # rg, an even faster version of ag
brew 'rs-git-fsmonitor' # Run `git config core.fsmonitor rs-git-fsmonitor` in large repos you want this magic in
brew 'rsync'
# brew 'rubyfmt' # Often outdated. Use precompile bin from https://github.com/penelopezone/rubyfmt/releases instead
brew 's3cmd'
brew 'shellcheck'
brew 'tldr'
brew 'tmux'
# brew 'toxiproxy'  # Requires "tap 'shopify/shopify'" above.
brew 'watch'
brew 'xz'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'

cask '1password'
cask '1password-cli'
# cask 'aerial' # Aerial screensaver
cask 'alfred'
# cask 'amazon-drive'
# cask 'amazon-music'
# cask 'apache-directory-studio'
# cask 'android-file-transfer' # Used as a backup to transfer files from my Garmin
cask 'appcleaner'
# cask 'arq'
cask 'balenaetcher'
# cask 'banktivity'
cask 'bartender'
cask 'calibre'
cask 'chatmate-for-whatsapp'
cask 'cleanmymac'
cask 'cleanshot'
cask 'concept2-utility'
cask 'dash'
cask 'divvy'
cask 'docker'
cask 'dropbox'
cask 'encryptme'
cask 'exodus'
cask 'fantastical'
cask 'firefox'
cask 'fliqlo'
cask 'flux'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'garmin-express'
# cask 'google-chrome'        # Think about the amount of data Google already has. Also https://chromeisbad.com/
# cask 'google-cloud-sdk'
# cask 'google-backup-and-sync'
# cask 'gpg-suite-no-mail'
# cask 'gpg-suite-pinentry'   # Temp disable for Big Sur
cask 'hammerspoon'
cask 'hey'
cask 'imagealpha'
cask 'imageoptim'
cask 'insomnia' # Alternative to Postman
cask 'iterm2'
# cask 'little-snitch' # Temp disable for Big Sur
cask 'karabiner-elements'
cask 'keybase'
cask 'mailtrackerblocker'
cask 'microblog'
# cask 'microsoft-edge'
# cask 'microsoft-teams'
cask 'multipass'    # Run Ubuntu Server easily locally
cask 'muzzle'
cask 'netnewswire'
cask 'netspot'
cask 'ngrok'
# cask 'numi'
cask 'obsidian'
# cask 'pallotron-yubiswitch'
cask 'postman'
cask 'qlmarkdown'   # QuickLook support for markdown
cask 'qlimagesize'  # QuickLook support for webp and showing image dimensions
cask 'raycast'      # Alfred alternative
cask 'rocket'
cask 'signal'
# cask 'skype'
cask 'skitch'
cask 'sketch'
cask 'slack'
cask 'spotify'
# cask 'teamviewer'
cask 'telegram'
cask 'textexpander'
cask 'the-unarchiver'
cask 'transmission'
cask 'transmit'
# cask 'vagrant'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
cask 'viscosity'
cask 'visual-studio-code'
# cask 'vlc'
# cask 'vmware-fusion'
# cask 'wireshark' # This is having problems installing at the mo - Oct 2019.
# cask 'yubico-yubikey-manager'
# cask 'zwift'

# AppStore Apps
mas 'Bear', id: 1_091_189_122
mas 'Magnet', id: 441_258_766
mas 'Microsoft OneNote', id: 784_801_555
mas 'Microsoft Remote Desktop 10', id: 1_295_203_466
mas 'Monit', id: 1_014_850_245
mas 'Monosnap', id: 540_348_655
mas 'Pixelmator', id: 407_963_104
mas 'pomodorome', id: 1_484_801_884
# mas 'Tot', id: 1_491_071_483
mas 'WireGuard', id: 1_451_685_025
